### Environment: `planning-slack-bot`
#### Terraform Format and Style: `success`
#### Terraform Initialization: `success`
#### Terraform Plan: `success`
<details><summary>Show Plan</summary>

```terraform
aws_ecr_repository.planning_bot: Refreshing state... [id=planning-bot]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_ecr_repository.planning_bot has been changed
  ~ resource "aws_ecr_repository" "planning_bot" {
        id                   = "planning-bot"
        name                 = "planning-bot"
      + tags                 = {}
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # nomad_job.planning_bot will be created
  + resource "nomad_job" "planning_bot" {
      + allocation_ids          = (known after apply)
      + datacenters             = [
          + "makimo1",
        ]
      + deployment_id           = (known after apply)
      + deployment_status       = (known after apply)
      + deregister_on_destroy   = true
      + deregister_on_id_change = true
      + detach                  = true
      + id                      = (known after apply)
      + jobspec                 = <<-EOT
            job "planning-bot" {
              datacenters = ["makimo1"]
              type = "service"
            
              group "bot" {
                network {
                  port "http" { to = 8080 }
                }
            
                task "bot" {
                  driver = "docker"
            
                  config {
                    image = "198488405862.dkr.ecr.eu-west-1.amazonaws.com/planning-bot:f2d3b5b03607ac732e13e7da00122e38e44c6ffe"
                    ports = ["http"]
                  }
            
                  resources {
                    cpu = 500
                    memory = 512
                  }
                }
            
                service {
                  name = "planning-bot"
                  port = "http"
                }
              }
            }
        EOT
      + modify_index            = (known after apply)
      + name                    = "planning-bot"
      + namespace               = "default"
      + region                  = (known after apply)
      + task_groups             = [
          + {
              + count   = 1
              + meta    = (known after apply)
              + name    = "bot"
              + task    = [
                  + {
                      + driver        = "docker"
                      + meta          = (known after apply)
                      + name          = "bot"
                      + volume_mounts = null
                    },
                ]
              + volumes = null
            },
        ]
      + type                    = "service"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @Struchu, Action: `pull_request`*